I am going to explore my data files. I need to merge these into one table for modeling.
I will start with ipc_ken_area_long.csv.

In [ ]:
#   %cd ..

c:\Users\valar\Documents\Flatiron\Assignments\PHASE-5-PROJECT---PREDICTING-FOOD-INSECURITY

In [2]:
# Importing libraries
import pandas as pd

df_ipc = pd.read_csv("./data/ipc_ken_area_long.csv")
df_ipc.head()

,Date of analysis,Country,Total country population,Level 1,Area,Validity period,From,To,Phase,Number,Percentage
0,Jul 2025,KEN,16617000,Others,Marsabit,current,2025-07-01,2025-09-30,all,515000,1.00
1,Jul 2025,KEN,16617000,Others,Marsabit,current,2025-07-01,2025-09-30,3+,103000,0.20
2,Jul 2025,KEN,16617000,Others,Marsabit,current,2025-07-01,2025-09-30,1,128750,0.25
3,Jul 2025,KEN,16617000,Others,Marsabit,current,2025-07-01,2025-09-30,2,283250,0.55
4,Jul 2025,KEN,16617000,Others,Marsabit,current,2025-07-01,2025-09-30,3,103000,0.20

In [3]:
df_ipc.head(20)

,Date of analysis,Country,Total country population,Level 1,Area,Validity period,From,To,Phase,Number,Percentage
0,Jul 2025,KEN,16617000,Others,Marsabit,current,2025-07-01,2025-09-30,all,515000,1.00
1,Jul 2025,KEN,16617000,Others,Marsabit,current,2025-07-01,2025-09-30,3+,103000,0.20
2,Jul 2025,KEN,16617000,Others,Marsabit,current,2025-07-01,2025-09-30,1,128750,0.25
3,Jul 2025,KEN,16617000,Others,Marsabit,current,2025-07-01,2025-09-30,2,283250,0.55
4,Jul 2025,KEN,16617000,Others,Marsabit,current,2025-07-01,2025-09-30,3,103000,0.20
5,Jul 2025,KEN,16617000,Others,Marsabit,current,2025-07-01,2025-09-30,4,0,0.00
6,Jul 2025,KEN,16617000,Others,Marsabit,current,2025-07-01,2025-09-30,5,0,0.00
7,Jul 2025,KEN,16617000,Others,Marsabit,first projection,2025-10-01,2026-01-31,all,515000,1.00
8,Jul 2025,KEN,16617000,Others,Marsabit,first projection,2025-10-01,2026-01-31,3+,128750,0.25
9,Jul 2025,KEN,16617000,Others,Marsabit,first projection,2025-10-01,2026-01-31,1,103000,0.20
10,Jul 2025,KEN,16617000,Others,Marsabit,first projection,2025-10-01,2026-01-31,2,283250,0.55
11,Jul 2025,KEN,16617000,Others,Marsabit,first projection,2025-10-01,2026-01-31,3,128750,0.25
12,Jul 2025,KEN,16617000,Others,Marsabit,first projection,2025-10-01,2026-01-31,4,0,0.00
13,Jul 2025,KEN,16617000,Others,Marsabit,first projection,2025-10-01,2026-01-31,5,0,0.00
14,Jul 2025,KEN,16617000,Others,Baringo,current,2025-07-01,2025-09-30,all,733000,1.00
15,Jul 2025,KEN,16617000,Others,Baringo,current,2025-07-01,2025-09-30,3+,109950,0.15
16,Jul 2025,KEN,16617000,Others,Baringo,current,2025-07-01,2025-09-30,1,219900,0.30
17,Jul 2025,KEN,16617000,Others,Baringo,current,2025-07-01,2025-09-30,2,403150,0.55
18,Jul 2025,KEN,16617000,Others,Baringo,current,2025-07-01,2025-09-30,3,73300,0.10
19,Jul 2025,KEN,16617000,Others,Baringo,current,2025-07-01,2025-09-30,4,36650,0.05

In [4]:
df_ipc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4522 entries, 0 to 4521
Data columns (total 11 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Date of analysis          4522 non-null   object
 1   Country                   4522 non-null   object
 2   Total country population  4522 non-null   int64
 3   Level 1                   2912 non-null   object
 4   Area                      4522 non-null   object
 5   Validity period           4522 non-null   object
 6   From                      4522 non-null   object
 7   To                        4522 non-null   object
 8   Phase                     4522 non-null   object
 9   Number                    4522 non-null   int64
 10  Percentage                4522 non-null   float64
dtypes: float64(1), int64(2), object(8)
memory usage: 388.7+ KB

Columns to drop = Country( its all Kenyan data),Date of analysis,Total Country population,Level 1, Number.)

In [5]:
df_ipc = df_ipc.drop(['Date of analysis','Country','Total country population','Level 1','Number'], axis=1)
df_ipc.head()

       Area Validity period        From          To Phase  Percentage
0  Marsabit         current  2025-07-01  2025-09-30   all        1.00
1  Marsabit         current  2025-07-01  2025-09-30    3+        0.20
2  Marsabit         current  2025-07-01  2025-09-30     1        0.25
3  Marsabit         current  2025-07-01  2025-09-30     2        0.55
4  Marsabit         current  2025-07-01  2025-09-30     3        0.20

In [6]:
df_ipc = df_ipc[df_ipc['Phase'] == '3+']
df_ipc

            Area   Validity period        From          To Phase  Percentage
1       Marsabit           current  2025-07-01  2025-09-30    3+        0.20
8       Marsabit  first projection  2025-10-01  2026-01-31    3+        0.25
15       Baringo           current  2025-07-01  2025-09-30    3+        0.15
22       Baringo  first projection  2025-10-01  2026-01-31    3+        0.05
29          Embu           current  2025-07-01  2025-09-30    3+        0.05
...          ...               ...         ...         ...   ...         ...
4488     Turkana  first projection  2019-08-01  2019-10-31    3+        0.40
4495       Wajir           current  2019-07-01  2019-07-31    3+        0.25
4502       Wajir  first projection  2019-08-01  2019-10-31    3+        0.30
4509  West pokot           current  2019-07-01  2019-07-31    3+        0.10
4516  West pokot  first projection  2019-08-01  2019-10-31    3+        0.15

[646 rows x 6 columns]

In [7]:
# change percentage column to numeric
df_ipc['Percentage'] = pd.to_numeric(df_ipc['Percentage'], errors = 'coerce')
df_ipc['Percentage'].dtype

dtype('float64')

In [8]:
df_ipc.head(20)

         Area   Validity period        From          To Phase  Percentage
1    Marsabit           current  2025-07-01  2025-09-30    3+        0.20
8    Marsabit  first projection  2025-10-01  2026-01-31    3+        0.25
15    Baringo           current  2025-07-01  2025-09-30    3+        0.15
22    Baringo  first projection  2025-10-01  2026-01-31    3+        0.05
29       Embu           current  2025-07-01  2025-09-30    3+        0.05
36       Embu  first projection  2025-10-01  2026-01-31    3+        0.10
43       Meru           current  2025-07-01  2025-09-30    3+        0.10
50       Meru  first projection  2025-10-01  2026-01-31    3+        0.15
57     Isiolo           current  2025-07-01  2025-09-30    3+        0.10
64     Isiolo  first projection  2025-10-01  2026-01-31    3+        0.15
71     Kilifi           current  2025-07-01  2025-09-30    3+        0.05
78     Kilifi  first projection  2025-10-01  2026-01-31    3+        0.05
85    Makueni           current  2025-07-01  2025-09-30    3+        0.05
92    Makueni  first projection  2025-10-01  2026-01-31    3+        0.10
99   Laikipia           current  2025-07-01  2025-09-30    3+        0.05
106  Laikipia  first projection  2025-10-01  2026-01-31    3+        0.05
113     Kwale           current  2025-07-01  2025-09-30    3+        0.10
120     Kwale  first projection  2025-10-01  2026-01-31    3+        0.10
127   Mandera           current  2025-07-01  2025-09-30    3+        0.30
134   Mandera  first projection  2025-10-01  2026-01-31    3+        0.35

In [9]:
df_ipc

            Area   Validity period        From          To Phase  Percentage
1       Marsabit           current  2025-07-01  2025-09-30    3+        0.20
8       Marsabit  first projection  2025-10-01  2026-01-31    3+        0.25
15       Baringo           current  2025-07-01  2025-09-30    3+        0.15
22       Baringo  first projection  2025-10-01  2026-01-31    3+        0.05
29          Embu           current  2025-07-01  2025-09-30    3+        0.05
...          ...               ...         ...         ...   ...         ...
4488     Turkana  first projection  2019-08-01  2019-10-31    3+        0.40
4495       Wajir           current  2019-07-01  2019-07-31    3+        0.25
4502       Wajir  first projection  2019-08-01  2019-10-31    3+        0.30
4509  West pokot           current  2019-07-01  2019-07-31    3+        0.10
4516  West pokot  first projection  2019-08-01  2019-10-31    3+        0.15

[646 rows x 6 columns]

In [10]:
df_ipc.info()

<class 'pandas.core.frame.DataFrame'>
Index: 646 entries, 1 to 4516
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Area             646 non-null    object
 1   Validity period  646 non-null    object
 2   From             646 non-null    object
 3   To               646 non-null    object
 4   Phase            646 non-null    object
 5   Percentage       646 non-null    float64
dtypes: float64(1), object(5)
memory usage: 35.3+ KB

In [11]:
df_ipc.tail(20)

,Area,Validity period,From,To,Phase,Percentage
4383,Meru,current,2019-07-01,2019-07-31,3+,0.20
4390,Meru,first projection,2019-08-01,2019-10-31,3+,0.25
4397,Narok,current,2019-07-01,2019-07-31,3+,0.00
4404,Narok,first projection,2019-08-01,2019-10-31,3+,0.00
4411,Nyeri,current,2019-07-01,2019-07-31,3+,0.05
4418,Nyeri,first projection,2019-08-01,2019-10-31,3+,0.10
4425,Samburu,current,2019-07-01,2019-07-31,3+,0.25
4432,Samburu,first projection,2019-08-01,2019-10-31,3+,0.30
4439,Taita taveta,current,2019-07-01,2019-07-31,3+,0.10
4446,Taita taveta,first projection,2019-08-01,2019-10-31,3+,0.15
4453,Tana river,current,2019-07-01,2019-07-31,3+,0.30
4460,Tana river,first projection,2019-08-01,2019-10-31,3+,0.35
4467,Tharaka-nithi,current,2019-07-01,2019-07-31,3+,0.20
4474,Tharaka-nithi,first projection,2019-08-01,2019-10-31,3+,0.25
4481,Turkana,current,2019-07-01,2019-07-31,3+,0.35
4488,Turkana,first projection,2019-08-01,2019-10-31,3+,0.40
4495,Wajir,current,2019-07-01,2019-07-31,3+,0.25
4502,Wajir,first projection,2019-08-01,2019-10-31,3+,0.30
4509,West pokot,current,2019-07-01,2019-07-31,3+,0.10
4516,West pokot,first projection,2019-08-01,2019-10-31,3+,0.15

In [12]:
# Standardizing columns
df_ipc['From'] = pd.to_datetime(df_ipc['From'])
df_ipc['Month'] = df_ipc['From'].dt.to_period('M')
df_ipc.head()

,Area,Validity period,From,To,Phase,Percentage,Month
1,Marsabit,current,2025-07-01,2025-09-30,3+,0.20,2025-07
8,Marsabit,first projection,2025-10-01,2026-01-31,3+,0.25,2025-10
15,Baringo,current,2025-07-01,2025-09-30,3+,0.15,2025-07
22,Baringo,first projection,2025-10-01,2026-01-31,3+,0.05,2025-10
29,Embu,current,2025-07-01,2025-09-30,3+,0.05,2025-07

In [13]:
df_ipc[df_ipc['Percentage'] > 0]

,Area,Validity period,From,To,Phase,Percentage,Month
1,Marsabit,current,2025-07-01,2025-09-30,3+,0.20,2025-07
8,Marsabit,first projection,2025-10-01,2026-01-31,3+,0.25,2025-10
15,Baringo,current,2025-07-01,2025-09-30,3+,0.15,2025-07
22,Baringo,first projection,2025-10-01,2026-01-31,3+,0.05,2025-10
29,Embu,current,2025-07-01,2025-09-30,3+,0.05,2025-07
...,...,...,...,...,...,...,...
4488,Turkana,first projection,2019-08-01,2019-10-31,3+,0.40,2019-08
4495,Wajir,current,2019-07-01,2019-07-31,3+,0.25,2019-07
4502,Wajir,first projection,2019-08-01,2019-10-31,3+,0.30,2019-08
4509,West pokot,current,2019-07-01,2019-07-31,3+,0.10,2019-07
4516,West pokot,first projection,2019-08-01,2019-10-31,3+,0.15,2019-08

In [14]:
# add target column 
df_ipc['in_Phase3+'] = (df_ipc['Percentage'] >= 0).astype(int)
df_ipc

,Area,Validity period,From,To,Phase,Percentage,Month,in_Phase3+
1,Marsabit,current,2025-07-01,2025-09-30,3+,0.20,2025-07,1
8,Marsabit,first projection,2025-10-01,2026-01-31,3+,0.25,2025-10,1
15,Baringo,current,2025-07-01,2025-09-30,3+,0.15,2025-07,1
22,Baringo,first projection,2025-10-01,2026-01-31,3+,0.05,2025-10,1
29,Embu,current,2025-07-01,2025-09-30,3+,0.05,2025-07,1
...,...,...,...,...,...,...,...,...
4488,Turkana,first projection,2019-08-01,2019-10-31,3+,0.40,2019-08,1
4495,Wajir,current,2019-07-01,2019-07-31,3+,0.25,2019-07,1
4502,Wajir,first projection,2019-08-01,2019-10-31,3+,0.30,2019-08,1
4509,West pokot,current,2019-07-01,2019-07-31,3+,0.10,2019-07,1
4516,West pokot,first projection,2019-08-01,2019-10-31,3+,0.15,2019-08,1

In [15]:
df_ipc = df_ipc.drop(['Validity period','From','To'],axis=1)
df_ipc

            Area Phase  Percentage    Month  in_Phase3+
1       Marsabit    3+        0.20  2025-07           1
8       Marsabit    3+        0.25  2025-10           1
15       Baringo    3+        0.15  2025-07           1
22       Baringo    3+        0.05  2025-10           1
29          Embu    3+        0.05  2025-07           1
...          ...   ...         ...      ...         ...
4488     Turkana    3+        0.40  2019-08           1
4495       Wajir    3+        0.25  2019-07           1
4502       Wajir    3+        0.30  2019-08           1
4509  West pokot    3+        0.10  2019-07           1
4516  West pokot    3+        0.15  2019-08           1

[646 rows x 5 columns]

In [16]:
df_ipc.duplicated().sum()

np.int64(0)

Exploring ipcphase data which contains older ipc data.

In [17]:
ipc = pd.read_excel('./data/ipcphase.xlsx')
ipc.head()

,row,source_organization,source_document,country,country_code,geographic_group,fewsnet_region,geographic_unit_full_name,geographic_unit_name,unit_type,...,specialization_type,dataseries_specialization_type,data_usage_policy,created,modified,status_changed,collection_status,collection_status_changed,collection_schedule,reporting_date
0,0,FEWS NET,"Food Security Outlook, Kenya",Kenya,KE,Eastern Africa,East Africa,"Aberdare Forest1, Murang'a, Central, Kenya",Aberdare Forest1,fsc_admin,...,/IPCPhase/,/IPCClassification/,Public,2020-11-25T18:47:21,2020-11-25T18:47:21,2020-11-25T18:53:10,Published,2021-01-05T21:16:32,Ad Hoc,2011-07-01
1,1,FEWS NET,"Food Security Outlook, Kenya",Kenya,KE,Eastern Africa,East Africa,"Aberdare Forest1, Murang'a, Central, Kenya",Aberdare Forest1,fsc_admin,...,/IPCPhase/,/IPCClassification/,Public,2020-11-25T18:47:21,2020-11-25T18:47:21,2020-11-25T18:53:10,Published,2021-01-05T21:16:32,Ad Hoc,2011-10-01
2,2,FEWS NET,"Food Security Outlook, Kenya",Kenya,KE,Eastern Africa,East Africa,"Aberdare Forest1, Murang'a, Central, Kenya",Aberdare Forest1,fsc_admin,...,/IPCPhase/,/IPCClassification/,Public,2020-11-25T18:47:21,2020-11-25T18:47:21,2020-11-25T18:53:10,Published,2021-01-05T21:16:32,Ad Hoc,2012-01-01
3,3,FEWS NET,"Food Security Outlook, Kenya",Kenya,KE,Eastern Africa,East Africa,"Aberdare Forest1, Murang'a, Central, Kenya",Aberdare Forest1,fsc_admin,...,/IPCPhase/,/IPCClassification/,Public,2020-11-25T18:47:21,2020-11-25T18:47:21,2020-11-25T18:53:10,Published,2021-01-05T21:16:32,Ad Hoc,2012-04-01
4,4,FEWS NET,"Food Security Outlook, Kenya",Kenya,KE,Eastern Africa,East Africa,"Aberdare Forest1, Murang'a, Central, Kenya",Aberdare Forest1,fsc_admin,...,/IPCPhase/,/IPCClassification/,Public,2020-11-25T18:47:21,2020-11-25T18:47:21,2020-11-25T18:53:10,Published,2021-01-05T21:16:31,Ad Hoc,2012-07-01

In [18]:
# taking only relevant columns
ipc = ipc[['geographic_unit_full_name','projection_start','projection_end','value']].copy()
ipc.head()

,geographic_unit_full_name,projection_start,projection_end,value
0,"Aberdare Forest1, Murang'a, Central, Kenya",2011-07-01,2011-07-31,1.0
1,"Aberdare Forest1, Murang'a, Central, Kenya",2011-10-01,2011-10-31,1.0
2,"Aberdare Forest1, Murang'a, Central, Kenya",2012-01-01,2012-01-31,1.0
3,"Aberdare Forest1, Murang'a, Central, Kenya",2012-04-01,2012-04-30,1.0
4,"Aberdare Forest1, Murang'a, Central, Kenya",2012-07-01,2012-07-31,1.0

In [19]:
# clean geographic column
ipc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27052 entries, 0 to 27051
Data columns (total 4 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   geographic_unit_full_name  27052 non-null  object
 1   projection_start           27052 non-null  object
 2   projection_end             27052 non-null  object
 3   value                      27052 non-null  float64
dtypes: float64(1), object(3)
memory usage: 845.5+ KB

In [20]:
ipc['Area'] = ipc['geographic_unit_full_name'].str.split(',').str[1].str.strip()
ipc.head(25)

,geographic_unit_full_name,projection_start,projection_end,value,Area
0,"Aberdare Forest1, Murang'a, Central, Kenya",2011-07-01,2011-07-31,1.0,Murang'a
1,"Aberdare Forest1, Murang'a, Central, Kenya",2011-10-01,2011-10-31,1.0,Murang'a
2,"Aberdare Forest1, Murang'a, Central, Kenya",2012-01-01,2012-01-31,1.0,Murang'a
3,"Aberdare Forest1, Murang'a, Central, Kenya",2012-04-01,2012-04-30,1.0,Murang'a
4,"Aberdare Forest1, Murang'a, Central, Kenya",2012-07-01,2012-07-31,1.0,Murang'a
5,"Aberdare Forest1, Murang'a, Central, Kenya",2012-10-01,2012-10-31,1.0,Murang'a
6,"Aberdare Forest1, Murang'a, Central, Kenya",2013-01-01,2013-01-31,1.0,Murang'a
7,"Aberdare Forest1, Murang'a, Central, Kenya",2013-04-01,2013-04-30,1.0,Murang'a
8,"Aberdare Forest1, Murang'a, Central, Kenya",2013-07-01,2013-07-31,1.0,Murang'a
9,"Aberdare Forest1, Murang'a, Central, Kenya",2013-10-01,2013-10-31,1.0,Murang'a
10,"Aberdare Forest1, Murang'a, Central, Kenya",2014-01-01,2014-01-31,1.0,Murang'a
11,"Aberdare Forest1, Murang'a, Central, Kenya",2014-04-01,2014-04-30,1.0,Murang'a
12,"Aberdare Forest1, Murang'a, Central, Kenya",2014-07-01,2014-07-31,1.0,Murang'a
13,"Aberdare Forest1, Murang'a, Central, Kenya",2014-10-01,2014-10-31,1.0,Murang'a
14,"Aberdare Forest1, Murang'a, Central, Kenya",2015-01-01,2015-01-31,1.0,Murang'a
15,"Aberdare Forest1, Murang'a, Central, Kenya",2015-04-01,2015-04-30,1.0,Murang'a
16,"Aberdare Forest1, Murang'a, Central, Kenya",2015-07-01,2015-07-31,1.0,Murang'a
17,"Aberdare Forest1, Murang'a, Central, Kenya",2015-10-01,2015-10-31,1.0,Murang'a
18,"Aberdare Forest1, Murang'a, Central, Kenya",2016-02-01,2016-02-29,1.0,Murang'a
19,"Aberdare Forest, Nyeri, Central, Kenya",2011-07-01,2011-07-31,1.0,Nyeri
20,"Aberdare Forest, Nyeri, Central, Kenya",2011-10-01,2011-10-31,1.0,Nyeri
21,"Aberdare Forest, Nyeri, Central, Kenya",2012-01-01,2012-01-31,1.0,Nyeri
22,"Aberdare Forest, Nyeri, Central, Kenya",2012-04-01,2012-04-30,1.0,Nyeri
23,"Aberdare Forest, Nyeri, Central, Kenya",2012-07-01,2012-07-31,1.0,Nyeri
24,"Aberdare Forest, Nyeri, Central, Kenya",2012-10-01,2012-10-31,1.0,Nyeri

In [21]:
ipc['Area'].value_counts().tail(10)

Area
Teso North       27
Teso South       27
Webuye West      27
Eastern          26
Nyanza           24
Kenya            18
Western          16
Central          14
Coast            14
North Eastern     8
Name: count, dtype: int64

In [22]:
mask = ipc['Area'].isin(['High Potential Zone','Mixed Farming Zone','North Mugirango','Nyaribari Chache',   
'Nyaribari Masaba','Gilgil','Sigowet/Soin','Sirisia','Sotik','South Mugirango','Bahati','Endebess','Njoro',
'Nakuru Town East',"Nakuru Town West","Ol Kalou","Subukia",'Alego Usonga','Ugunja','Ugenya','Webuye East','Webuye West'])

ipc.loc[mask, 'Area'] = (
    ipc.loc[mask, 'geographic_unit_full_name']
    .str.rsplit(',', n=2)
    .str[-2]
    .str.strip()
)

In [23]:
mask2 = ipc['Area'].isin([
    'Western','Kenya','Eastern','Central','Coast','Nyanza'])

ipc.loc[mask2,'Area'] = (ipc.loc[mask, 'geographic_unit_full_name']
        .str.split(',')
        .str[0]
        .str.strip())

In [24]:
ipc = ipc[['Area'] + [c for c in ipc.columns if c != 'Area']]
ipc.head()

,Area,geographic_unit_full_name,projection_start,projection_end,value
0,Murang'a,"Aberdare Forest1, Murang'a, Central, Kenya",2011-07-01,2011-07-31,1.0
1,Murang'a,"Aberdare Forest1, Murang'a, Central, Kenya",2011-10-01,2011-10-31,1.0
2,Murang'a,"Aberdare Forest1, Murang'a, Central, Kenya",2012-01-01,2012-01-31,1.0
3,Murang'a,"Aberdare Forest1, Murang'a, Central, Kenya",2012-04-01,2012-04-30,1.0
4,Murang'a,"Aberdare Forest1, Murang'a, Central, Kenya",2012-07-01,2012-07-31,1.0

In [25]:
ipc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27052 entries, 0 to 27051
Data columns (total 5 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Area                       26940 non-null  object
 1   geographic_unit_full_name  27052 non-null  object
 2   projection_start           27052 non-null  object
 3   projection_end             27052 non-null  object
 4   value                      27052 non-null  float64
dtypes: float64(1), object(4)
memory usage: 1.0+ MB

In [26]:
ipc['projection_start'] = pd.to_datetime(ipc['projection_start'])
ipc['Month'] = ipc['projection_start'].dt.to_period('M')
ipc['in_Phase3+'] = (ipc['value'] >= 3).astype(int)
ipc.head()

,Area,geographic_unit_full_name,projection_start,projection_end,value,Month,in_Phase3+
0,Murang'a,"Aberdare Forest1, Murang'a, Central, Kenya",2011-07-01,2011-07-31,1.0,2011-07,0
1,Murang'a,"Aberdare Forest1, Murang'a, Central, Kenya",2011-10-01,2011-10-31,1.0,2011-10,0
2,Murang'a,"Aberdare Forest1, Murang'a, Central, Kenya",2012-01-01,2012-01-31,1.0,2012-01,0
3,Murang'a,"Aberdare Forest1, Murang'a, Central, Kenya",2012-04-01,2012-04-30,1.0,2012-04,0
4,Murang'a,"Aberdare Forest1, Murang'a, Central, Kenya",2012-07-01,2012-07-31,1.0,2012-07,0

In [27]:
ipc.duplicated().sum()

np.int64(0)

In [28]:
# inspecting duplicated rows
duplicated_mask = ipc.duplicated(subset=['Area','Month'], keep = False)
ipc[duplicated_mask]

,Area,geographic_unit_full_name,projection_start,projection_end,value,Month,in_Phase3+
0,Murang'a,"Aberdare Forest1, Murang'a, Central, Kenya",2011-07-01,2011-07-31,1.0,2011-07,0
1,Murang'a,"Aberdare Forest1, Murang'a, Central, Kenya",2011-10-01,2011-10-31,1.0,2011-10,0
2,Murang'a,"Aberdare Forest1, Murang'a, Central, Kenya",2012-01-01,2012-01-31,1.0,2012-01,0
3,Murang'a,"Aberdare Forest1, Murang'a, Central, Kenya",2012-04-01,2012-04-30,1.0,2012-04,0
4,Murang'a,"Aberdare Forest1, Murang'a, Central, Kenya",2012-07-01,2012-07-31,1.0,2012-07,0
...,...,...,...,...,...,...,...
27047,Machakos,"Yatta, Machakos, Eastern, Kenya",2015-01-01,2015-01-31,1.0,2015-01,0
27048,Machakos,"Yatta, Machakos, Eastern, Kenya",2015-04-01,2015-04-30,1.0,2015-04,0
27049,Machakos,"Yatta, Machakos, Eastern, Kenya",2015-07-01,2015-07-31,1.0,2015-07,0
27050,Machakos,"Yatta, Machakos, Eastern, Kenya",2015-10-01,2015-10-31,1.0,2015-10,0
27051,Machakos,"Yatta, Machakos, Eastern, Kenya",2016-02-01,2016-02-29,1.0,2016-02,0

In [29]:
ipc = ipc.drop(['projection_start','projection_end'],axis=1)

In [30]:
# Merging ipc and df_ipc
ipc_merged = ipc.merge(df_ipc,on=['Area','Month'],
                how='left',
                suffixes=['all','_r'])

In [31]:
ipc_merged.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27052 entries, 0 to 27051
Data columns (total 8 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Area                       26940 non-null  object
 1   geographic_unit_full_name  27052 non-null  object
 2   value                      27052 non-null  float64
 3   Month                      27052 non-null  period[M]
 4   in_Phase3+all              27052 non-null  int64
 5   Phase                      251 non-null    object
 6   Percentage                 251 non-null    float64
 7   in_Phase3+_r               251 non-null    float64
dtypes: float64(3), int64(1), object(3), period[M](1)
memory usage: 1.7+ MB

In [32]:
ipc_merged = ipc_merged.drop(['in_Phase3+_r','Percentage','Phase'],axis=1)
ipc_merged.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27052 entries, 0 to 27051
Data columns (total 5 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Area                       26940 non-null  object
 1   geographic_unit_full_name  27052 non-null  object
 2   value                      27052 non-null  float64
 3   Month                      27052 non-null  period[M]
 4   in_Phase3+all              27052 non-null  int64
dtypes: float64(1), int64(1), object(2), period[M](1)
memory usage: 1.0+ MB

In [33]:
ipc_merged.isna().sum()

Area                         112
geographic_unit_full_name      0
value                          0
Month                          0
in_Phase3+all                  0
dtype: int64

In [34]:
ipc_merged[ipc_merged['Area'].isna()]

      Area geographic_unit_full_name  value    Month  in_Phase3+all
612    NaN      Bondo, Nyanza, Kenya    1.0  2011-01              0
613    NaN      Bondo, Nyanza, Kenya    1.0  2011-04              0
709    NaN   Bungoma, Western, Kenya    1.0  2011-01              0
710    NaN   Bungoma, Western, Kenya    1.0  2011-04              0
789    NaN     Busia, Western, Kenya    1.0  2011-01              0
...    ...                       ...    ...      ...            ...
21125  NaN   Tharaka, Eastern, Kenya    2.0  2011-04              0
21126  NaN     Thika, Central, Kenya    1.0  2011-01              0
21127  NaN     Thika, Central, Kenya    1.0  2011-04              0
21887  NaN    Vihiga, Western, Kenya    1.0  2011-01              0
21888  NaN    Vihiga, Western, Kenya    1.0  2011-04              0

[112 rows x 5 columns]

In [35]:
ipc_merged = ipc_merged.dropna(subset=['Area'])

In [36]:
ipc_merged.info()

<class 'pandas.core.frame.DataFrame'>
Index: 26940 entries, 0 to 27051
Data columns (total 5 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Area                       26940 non-null  object
 1   geographic_unit_full_name  26940 non-null  object
 2   value                      26940 non-null  float64
 3   Month                      26940 non-null  period[M]
 4   in_Phase3+all              26940 non-null  int64
dtypes: float64(1), int64(1), object(2), period[M](1)
memory usage: 1.2+ MB

In [37]:
ipc_merged.rename(columns={'Area':'County','value':'IPC', 'in_Phase3+all':'in_Phase3+'},
                  inplace=True)
ipc_merged.head()

,County,geographic_unit_full_name,IPC,Month,in_Phase3+
0,Murang'a,"Aberdare Forest1, Murang'a, Central, Kenya",1.0,2011-07,0
1,Murang'a,"Aberdare Forest1, Murang'a, Central, Kenya",1.0,2011-10,0
2,Murang'a,"Aberdare Forest1, Murang'a, Central, Kenya",1.0,2012-01,0
3,Murang'a,"Aberdare Forest1, Murang'a, Central, Kenya",1.0,2012-04,0
4,Murang'a,"Aberdare Forest1, Murang'a, Central, Kenya",1.0,2012-07,0

In [38]:
ipc_merged['County'].value_counts()

County
Nairobi          640
Makueni          477
Kiambu           473
Nakuru           466
Machakos         398
                ...
Tongaren          27
Tinderet          27
Teso South        27
Teso North        27
North Eastern      8
Name: count, Length: 423, dtype: int64

In [39]:
# ipc_merged.to_csv('./data/cleaned_ipc.csv',index=False)

In [40]:
# opening cleaned_ipc
c_ipc = pd.read_csv('./data/cleaned_ipc.csv')
c_ipc.head(20)

,County,geographic_unit_full_name,IPC,Month,in_Phase3+
0,MMarsabitg'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2011-07,0
1,MMarsabitg'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2011-10,0
2,MMarsabitg'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2012-01,0
3,MMarsabitg'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2012-04,0
4,MMarsabitg'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2012-07,0
5,MMarsabitg'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2012-10,0
6,MMarsabitg'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2013-01,0
7,MMarsabitg'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2013-04,0
8,MMarsabitg'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2013-07,0
9,MMarsabitg'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2013-10,0
10,MMarsabitg'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2014-01,0
11,MMarsabitg'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2014-04,0
12,MMarsabitg'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2014-07,0
13,MMarsabitg'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2014-10,0
14,MMarsabitg'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2015-01,0
15,MMarsabitg'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2015-04,0
16,MMarsabitg'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2015-07,0
17,MMarsabitg'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2015-10,0
18,MMarsabitg'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2016-02,0
19,Nyeri,"Aberdare Forest, Nyeri, Central, Kenya",1,2011-07,0

In [41]:
c_ipc['County'].value_counts().tail(20)

County
Embu                     325
Nyandarua                314
Uasin Gishu              278
Vihiga                   276
Laikipia                 270
Taita Taveta             268
Tharaka-Nithi            252
Bomet                    251
Mombasa                  238
Elgeyo-Marakwet          213
Nyamira                  203
Kirinyaga                203
Elgeyo-Marakwet West      81
Elgeyo-Marakwet North     81
Tharaka-Nithi Nithi       54
Elgeyo-Marakwet East      54
Elgeyo-Marakwet South     54
Kapenguria                27
North Eastern              2
South Imenti               1
Name: count, dtype: int64

In [42]:
# correcting missed misspellings
county_corrections = {
    "MMarsabitg'a": "Murang'a",
    "Elgero-Marakwet East": "Elgeyo Marakwet",
    "Elgeyo-Marakwet West": "Elgeyo Marakwet",
    "Elgeyo-Marakwet North": "Elgeyo Marakwet",
    "Elgeyo-Marakwet South": "Elgeyo Marakwet",
    "Tharaka-Nithi Nithi": "Tharaka-Nithi",
    "South Imenti": "Meru",
    "North Eastern": "Garissa"
}
c_ipc['County'] = c_ipc['County'].replace(county_corrections)

In [43]:
c_ipc

,County,geographic_unit_full_name,IPC,Month,in_Phase3+
0,Murang'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2011-07,0
1,Murang'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2011-10,0
2,Murang'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2012-01,0
3,Murang'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2012-04,0
4,Murang'a,"Aberdare Forest1, MMarsabitg'a, Central, Kenya",1,2012-07,0
...,...,...,...,...,...
26935,Machakos,"Yatta, Machakos, Eastern, Kenya",1,2015-01,0
26936,Machakos,"Yatta, Machakos, Eastern, Kenya",1,2015-04,0
26937,Machakos,"Yatta, Machakos, Eastern, Kenya",1,2015-07,0
26938,Machakos,"Yatta, Machakos, Eastern, Kenya",1,2015-10,0
26939,Machakos,"Yatta, Machakos, Eastern, Kenya",1,2016-02,0

In [44]:
c_ipc.duplicated().sum()

np.int64(5130)

In [45]:
#checking how many county-month duplicated values there are
dup = c_ipc[c_ipc.duplicated(subset=['County','Month'], keep=False)]
dup.sort_values(['County','Month'])

,County,geographic_unit_full_name,IPC,Month,in_Phase3+
494,Baringo,"Baringo, Rift Valley, Kenya",2,2011-01,0
8276,Baringo,"Baringo, Rift Valley, Kenya",1,2011-01,0
495,Baringo,"Baringo, Rift Valley, Kenya",2,2011-04,0
8277,Baringo,"Baringo, Rift Valley, Kenya",1,2011-04,0
496,Baringo,"Bartabwa, Baringo, Rift Valley, Kenya",2,2011-07,0
...,...,...,...,...,...
22535,West Pokot,"Western Agropastoral Zone, Pokot South, West P...",2,2025-10,0
22589,West Pokot,"Western Agropastoral Zone, Sigor, West Pokot, ...",2,2025-10,0
26234,West Pokot,"Western Medium Potential Zone, Kacheliba, West...",2,2025-10,0
26261,West Pokot,"Western Medium Potential Zone, Kapenguria, Wes...",2,2025-10,0
26666,West Pokot,"Western Medium Potential Zone, Pokot South, We...",2,2025-10,0

In [46]:
c_ipc.groupby(['County','Month']).size().value_counts().sort_values()

3       2
23     19
27     19
47     27
33     27
45     27
29     27
34     27
26     27
39     27
19     27
2      35
17     46
1      51
18     65
15     65
16     65
4      73
13    103
12    108
10    111
11    122
7     130
8     165
14    165
5     173
9     222
6     295
Name: count, dtype: int64

In [47]:
# Replacing IPC values with the mean of the each County-Month duplicate and in_Phase3+ = True if any of the areas
# in that county was in phase 3.

df_ipc = (c_ipc.groupby(['County','Month'], as_index=False).agg(
    {'IPC': 'mean',
     'in_Phase3+': 'max'}
))
df_ipc

          County    Month       IPC  in_Phase3+
0        Baringo  2011-01  1.500000           0
1        Baringo  2011-04  1.500000           0
2        Baringo  2011-07  1.739130           1
3        Baringo  2011-10  1.826087           1
4        Baringo  2012-01  1.739130           0
...          ...      ...       ...         ...
2245  West Pokot  2023-10  1.777778           0
2246  West Pokot  2024-02  1.000000           0
2247  West Pokot  2024-06  1.000000           0
2248  West Pokot  2024-10  1.000000           0
2249  West Pokot  2025-10  2.000000           0

[2250 rows x 4 columns]

In [48]:
# Checking for any missing values or duplicated rows
print(df_ipc.isna().sum())
print(df_ipc.duplicated().sum())

County        0
Month         0
IPC           0
in_Phase3+    0
dtype: int64
0

In [49]:
df_ipc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2250 entries, 0 to 2249
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   County      2250 non-null   object
 1   Month       2250 non-null   object
 2   IPC         2250 non-null   float64
 3   in_Phase3+  2250 non-null   int64
dtypes: float64(1), int64(1), object(2)
memory usage: 70.4+ KB

In [50]:
# save cleaned data
# df_ipc.to_csv('./data/cleaned_ipc_final.csv')

# Exploring and cleaning food prices data
I am going to focus only on maize(white) prices as it is a staple food in kenya and the best indicator for food security.

In [51]:
df_fp = pd.read_csv('./data/wfp_food_prices_ken.csv')
df_fp.head(20)

,date,admin1,admin2,market,market_id,latitude,longitude,category,commodity,commodity_id,unit,priceflag,pricetype,currency,price,usdprice
0,#date,#adm1+name,#adm2+name,#loc+market+name,#loc+market+code,#geo+lat,#geo+lon,#item+type,#item+name,#item+code,#item+unit,#item+price+flag,#item+price+type,#currency+code,#value,#value+usd
1,2006-01-15,Coast,Mombasa,Mombasa,191,-4.05,39.67,cereals and tubers,Maize,51,KG,actual,Wholesale,KES,16.13,0.22
2,2006-01-15,Coast,Mombasa,Mombasa,191,-4.05,39.67,cereals and tubers,Maize (white),67,90 KG,actual,Wholesale,KES,1480,20.58
3,2006-01-15,Coast,Mombasa,Mombasa,191,-4.05,39.67,pulses and nuts,Beans,50,KG,actual,Wholesale,KES,33.63,0.47
4,2006-01-15,Eastern,Kitui,Kitui,187,-1.37,38.02,cereals and tubers,Maize (white),67,KG,actual,Retail,KES,17,0.24
5,2006-01-15,Eastern,Kitui,Kitui,187,-1.37,38.02,cereals and tubers,Sorghum,65,90 KG,actual,Wholesale,KES,1800,25.03
6,2006-01-15,Nairobi,Nairobi,Nairobi,184,-1.28,36.82,cereals and tubers,Maize,51,KG,actual,Wholesale,KES,15.48,0.22
7,2006-01-15,Nairobi,Nairobi,Nairobi,184,-1.28,36.82,cereals and tubers,Maize (white),67,90 KG,actual,Wholesale,KES,1399,19.46
8,2006-01-15,Nairobi,Nairobi,Nairobi,184,-1.28,36.82,cereals and tubers,Potatoes (Irish),148,50 KG,actual,Wholesale,KES,664.43,9.24
9,2006-01-15,Nairobi,Nairobi,Nairobi,184,-1.28,36.82,cereals and tubers,Sorghum,65,90 KG,actual,Wholesale,KES,1960,27.26
10,2006-01-15,Nairobi,Nairobi,Nairobi,184,-1.28,36.82,milk and dairy,"Milk (cow, pasteurized)",472,500 ML,actual,Retail,KES,22,0.31
11,2006-01-15,Nairobi,Nairobi,Nairobi,184,-1.28,36.82,oil and fats,Oil (vegetable),96,L,actual,Retail,KES,115,1.6
12,2006-01-15,Nairobi,Nairobi,Nairobi,184,-1.28,36.82,pulses and nuts,Beans (dry),262,90 KG,actual,Wholesale,KES,3175,44.16
13,2006-01-15,North Eastern,Mandera,Mandera,189,3.94,41.86,cereals and tubers,Maize (white),67,KG,actual,Retail,KES,30,0.42
14,2006-01-15,Nyanza,Kisumu,Kisumu,186,-0.1,34.75,cereals and tubers,Maize,51,KG,actual,Wholesale,KES,14.84,0.21
15,2006-01-15,Nyanza,Kisumu,Kisumu,186,-0.1,34.75,cereals and tubers,Maize (white),67,90 KG,actual,Wholesale,KES,1320,18.36
16,2006-01-15,Nyanza,Kisumu,Kisumu,186,-0.1,34.75,cereals and tubers,Sorghum,65,90 KG,actual,Wholesale,KES,1600,22.25
17,2006-01-15,Nyanza,Kisumu,Kisumu,186,-0.1,34.75,pulses and nuts,Beans (dry),262,90 KG,actual,Wholesale,KES,4000,55.63
18,2006-01-15,Rift Valley,Uasin Gishu,Eldoret town (Uasin Gishu),185,0.52,35.28,cereals and tubers,Maize,51,KG,actual,Wholesale,KES,12.96,0.18
19,2006-01-15,Rift Valley,Uasin Gishu,Eldoret town (Uasin Gishu),185,0.52,35.28,cereals and tubers,Maize (white),67,90 KG,actual,Wholesale,KES,1192,16.58

In [52]:
df_fp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17365 entries, 0 to 17364
Data columns (total 16 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          17365 non-null  object
 1   admin1        17315 non-null  object
 2   admin2        17315 non-null  object
 3   market        17365 non-null  object
 4   market_id     17365 non-null  object
 5   latitude      17315 non-null  object
 6   longitude     17315 non-null  object
 7   category      17365 non-null  object
 8   commodity     17365 non-null  object
 9   commodity_id  17365 non-null  object
 10  unit          17365 non-null  object
 11  priceflag     17365 non-null  object
 12  pricetype     17365 non-null  object
 13  currency      17365 non-null  object
 14  price         17365 non-null  object
 15  usdprice      17365 non-null  object
dtypes: object(16)
memory usage: 2.1+ MB

In [53]:
df_fp = df_fp[df_fp['commodity_id'].isin(['51','67'])].copy()
df_fp.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2348 entries, 1 to 17356
Data columns (total 16 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          2348 non-null   object
 1   admin1        2298 non-null   object
 2   admin2        2298 non-null   object
 3   market        2348 non-null   object
 4   market_id     2348 non-null   object
 5   latitude      2298 non-null   object
 6   longitude     2298 non-null   object
 7   category      2348 non-null   object
 8   commodity     2348 non-null   object
 9   commodity_id  2348 non-null   object
 10  unit          2348 non-null   object
 11  priceflag     2348 non-null   object
 12  pricetype     2348 non-null   object
 13  currency      2348 non-null   object
 14  price         2348 non-null   object
 15  usdprice      2348 non-null   object
dtypes: object(16)
memory usage: 311.8+ KB

In [54]:
df_fp['commodity'].value_counts()

commodity
Maize (white)    1234
Maize            1114
Name: count, dtype: int64

In [55]:
df_fp

,date,admin1,admin2,market,market_id,latitude,longitude,category,commodity,commodity_id,unit,priceflag,pricetype,currency,price,usdprice
1,2006-01-15,Coast,Mombasa,Mombasa,191,-4.05,39.67,cereals and tubers,Maize,51,KG,actual,Wholesale,KES,16.13,0.22
2,2006-01-15,Coast,Mombasa,Mombasa,191,-4.05,39.67,cereals and tubers,Maize (white),67,90 KG,actual,Wholesale,KES,1480,20.58
4,2006-01-15,Eastern,Kitui,Kitui,187,-1.37,38.02,cereals and tubers,Maize (white),67,KG,actual,Retail,KES,17,0.24
6,2006-01-15,Nairobi,Nairobi,Nairobi,184,-1.28,36.82,cereals and tubers,Maize,51,KG,actual,Wholesale,KES,15.48,0.22
7,2006-01-15,Nairobi,Nairobi,Nairobi,184,-1.28,36.82,cereals and tubers,Maize (white),67,90 KG,actual,Wholesale,KES,1399,19.46
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17315,2025-11-15,Rift Valley,Turkana,Kakuma 3,3251,3.77,34.82,cereals and tubers,Maize,51,KG,aggregate,Retail,KES,55,0.43
17330,2025-11-15,Rift Valley,Turkana,Kalobeyei (Village 1),3244,3.77,34.73,cereals and tubers,Maize,51,KG,aggregate,Retail,KES,66.19,0.51
17340,2025-11-15,Rift Valley,Turkana,Kalobeyei (Village 2),3246,3.76,34.75,cereals and tubers,Maize,51,KG,aggregate,Retail,KES,65,0.5
17347,2025-11-15,Rift Valley,Turkana,Kalobeyei (Village 3),3247,3.75,34.76,cereals and tubers,Maize,51,KG,aggregate,Retail,KES,60,0.46
17356,2025-11-15,Rift Valley,Turkana,Mogadishu (Kakuma),3245,3.72,34.85,cereals and tubers,Maize,51,KG,aggregate,Retail,KES,62.59,0.48

In [56]:
df_p = df_fp[['date','admin2','market','unit','pricetype','price']].copy()
df_p.head()

         date   admin2   market   unit  pricetype  price
1  2006-01-15  Mombasa  Mombasa     KG  Wholesale  16.13
2  2006-01-15  Mombasa  Mombasa  90 KG  Wholesale   1480
4  2006-01-15    Kitui    Kitui     KG     Retail     17
6  2006-01-15  Nairobi  Nairobi     KG  Wholesale  15.48
7  2006-01-15  Nairobi  Nairobi  90 KG  Wholesale   1399

In [57]:
# checking to see if admin2 and market always have the same values
(df_p['admin2'] == df_p['market']).all()

np.False_

In [58]:
df_p[df_p['admin2'] != df_p['market']]

,date,admin2,market,unit,pricetype,price
18,2006-01-15,Uasin Gishu,Eldoret town (Uasin Gishu),KG,Wholesale,12.96
19,2006-01-15,Uasin Gishu,Eldoret town (Uasin Gishu),90 KG,Wholesale,1192
40,2006-02-15,Turkana,Lodwar (Turkana),KG,Retail,28
41,2006-02-15,Uasin Gishu,Eldoret town (Uasin Gishu),KG,Wholesale,13.12
66,2006-03-15,Turkana,Lodwar (Turkana),KG,Retail,27
...,...,...,...,...,...,...
17315,2025-11-15,Turkana,Kakuma 3,KG,Retail,55
17330,2025-11-15,Turkana,Kalobeyei (Village 1),KG,Retail,66.19
17340,2025-11-15,Turkana,Kalobeyei (Village 2),KG,Retail,65
17347,2025-11-15,Turkana,Kalobeyei (Village 3),KG,Retail,60
17356,2025-11-15,Turkana,Mogadishu (Kakuma),KG,Retail,62.59

In [59]:
df_p.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2348 entries, 1 to 17356
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       2348 non-null   object
 1   admin2     2298 non-null   object
 2   market     2348 non-null   object
 3   unit       2348 non-null   object
 4   pricetype  2348 non-null   object
 5   price      2348 non-null   object
dtypes: object(6)
memory usage: 128.4+ KB

In [60]:
df_p.isna().sum().sum()

np.int64(50)

In [61]:
null_df = df_p[df_p['admin2'].isna()]
null_df['market'].value_counts()

market
Hola (Tana River)    50
Name: count, dtype: int64

In [62]:
df_p['admin2'] = df_p['admin2'].fillna('Tana River')
df_p.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2348 entries, 1 to 17356
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       2348 non-null   object
 1   admin2     2348 non-null   object
 2   market     2348 non-null   object
 3   unit       2348 non-null   object
 4   pricetype  2348 non-null   object
 5   price      2348 non-null   object
dtypes: object(6)
memory usage: 128.4+ KB

In [63]:
# extracting numeric values from unit column to place in a separate column
df_p['unit_val'] = df_p['unit'].str.extract(r'(\d+)')
# fill null values from KG with 1
df_p['unit_val'] = df_p['unit_val'].fillna(1)

# turning unit_val and price columns to numeric
n_cols = ['unit_val','price']
df_p[n_cols]= df_p[n_cols].apply(pd.to_numeric,errors= 'coerce')
df_p.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2348 entries, 1 to 17356
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       2348 non-null   object
 1   admin2     2348 non-null   object
 2   market     2348 non-null   object
 3   unit       2348 non-null   object
 4   pricetype  2348 non-null   object
 5   price      2348 non-null   float64
 6   unit_val   2348 non-null   int64
dtypes: float64(1), int64(1), object(5)
memory usage: 146.8+ KB

In [64]:
import numpy as np
df_p['price_per_kg']= (df_p['price']/df_p['unit_val']).replace(0,np.nan)
df_p['price_per_kg'].describe()

count    2348.000000
mean       38.958950
std        17.573883
min         6.000000
25%        27.220000
50%        35.050000
75%        49.687500
max       120.000000
Name: price_per_kg, dtype: float64

In [65]:
df_p

,date,admin2,market,unit,pricetype,price,unit_val,price_per_kg
1,2006-01-15,Mombasa,Mombasa,KG,Wholesale,16.13,1,16.130000
2,2006-01-15,Mombasa,Mombasa,90 KG,Wholesale,1480.00,90,16.444444
4,2006-01-15,Kitui,Kitui,KG,Retail,17.00,1,17.000000
6,2006-01-15,Nairobi,Nairobi,KG,Wholesale,15.48,1,15.480000
7,2006-01-15,Nairobi,Nairobi,90 KG,Wholesale,1399.00,90,15.544444
...,...,...,...,...,...,...,...,...
17315,2025-11-15,Turkana,Kakuma 3,KG,Retail,55.00,1,55.000000
17330,2025-11-15,Turkana,Kalobeyei (Village 1),KG,Retail,66.19,1,66.190000
17340,2025-11-15,Turkana,Kalobeyei (Village 2),KG,Retail,65.00,1,65.000000
17347,2025-11-15,Turkana,Kalobeyei (Village 3),KG,Retail,60.00,1,60.000000
17356,2025-11-15,Turkana,Mogadishu (Kakuma),KG,Retail,62.59,1,62.590000

In [66]:
df_p = df_p[['date','admin2','price_per_kg']].copy()
df_p

             date   admin2  price_per_kg
1      2006-01-15  Mombasa     16.130000
2      2006-01-15  Mombasa     16.444444
4      2006-01-15    Kitui     17.000000
6      2006-01-15  Nairobi     15.480000
7      2006-01-15  Nairobi     15.544444
...           ...      ...           ...
17315  2025-11-15  Turkana     55.000000
17330  2025-11-15  Turkana     66.190000
17340  2025-11-15  Turkana     65.000000
17347  2025-11-15  Turkana     60.000000
17356  2025-11-15  Turkana     62.590000

[2348 rows x 3 columns]

In [67]:
df_p.groupby(['admin2','date']).size()

admin2   date
Baringo  2015-02-15    1
         2015-03-15    1
         2015-04-15    1
         2015-05-15    1
         2015-06-15    1
                      ..
Wajir    2021-02-15    1
         2021-03-15    1
         2021-04-15    1
         2021-08-15    1
         2021-09-15    1
Length: 1643, dtype: int64

In [68]:
df_p.rename(columns={'admin2':'County',
                     'date':'Month',
                     'price_per_kg': 'maize_price_per_kg'}, inplace=True)

In [69]:
df_p['Month'] = pd.to_datetime(df_p['Month'])
df_p['Month'] = df_p['Month'].dt.to_period('M')
month_counts = df_p.groupby('County')['Month'].nunique()
month_counts

County
Baringo         52
Garissa         90
Isiolo           4
Kajiado         51
Kilifi          39
Kisumu         166
Kitui          124
Mandera        115
Marsabit       126
Mombasa        162
Nairobi        191
Nakuru         108
Tana River      50
Turkana        168
Uasin Gishu    192
Wajir            5
Name: Month, dtype: int64

In [70]:
df_p = df_p.groupby(['County','Month'], as_index = False ).agg(
    {'maize_price_per_kg': 'mean'}
)
df_p

       County    Month  maize_price_per_kg
0     Baringo  2015-02                47.0
1     Baringo  2015-03                38.0
2     Baringo  2015-04                42.0
3     Baringo  2015-05                45.0
4     Baringo  2015-06                45.0
...       ...      ...                 ...
1638    Wajir  2021-02                50.0
1639    Wajir  2021-03                50.0
1640    Wajir  2021-04                50.0
1641    Wajir  2021-08                50.0
1642    Wajir  2021-09                50.0

[1643 rows x 3 columns]

In [71]:
df_p = df_p[df_p['Month'] >= pd.Period('2015-01',freq='M')].copy()
# creating a full county and monthly index
months = pd.period_range(df_p['Month'].min(),df_p['Month'].max(),freq = 'M')
counties = df_p['County'].unique()
full_index = pd.MultiIndex.from_product([counties,months], names=['County','Month'])

# reindexing
df_p = df_p.set_index(['County','Month']).reindex(full_index).reset_index()

df_p

       County    Month  maize_price_per_kg
0     Baringo  2015-01                 NaN
1     Baringo  2015-02                47.0
2     Baringo  2015-03                38.0
3     Baringo  2015-04                42.0
4     Baringo  2015-05                45.0
...       ...      ...                 ...
2091    Wajir  2025-07                 NaN
2092    Wajir  2025-08                 NaN
2093    Wajir  2025-09                 NaN
2094    Wajir  2025-10                 NaN
2095    Wajir  2025-11                 NaN

[2096 rows x 3 columns]

In [72]:

# forward filling missing prices 
df_p['maize_price_per_kg'] = df_p.groupby('County')['maize_price_per_kg'].ffill()
#back filling missing prices
df_p['maize_price_per_kg'] = df_p.groupby('County')['maize_price_per_kg'].bfill()

# adding lag features
df_p['price_lag1'] = df_p.groupby('County')['maize_price_per_kg'].shift(1)
df_p['price_lag2'] = df_p.groupby('County')['maize_price_per_kg'].shift(2)
df_p['price_pct_change'] = df_p.groupby('County')['maize_price_per_kg'].pct_change()
df_p

,County,Month,maize_price_per_kg,price_lag1,price_lag2,price_pct_change
0,Baringo,2015-01,47.0,NaN,NaN,NaN
1,Baringo,2015-02,47.0,47.0,NaN,0.000000
2,Baringo,2015-03,38.0,47.0,47.0,-0.191489
3,Baringo,2015-04,42.0,38.0,47.0,0.105263
4,Baringo,2015-05,45.0,42.0,38.0,0.071429
...,...,...,...,...,...,...
2091,Wajir,2025-07,50.0,50.0,50.0,0.000000
2092,Wajir,2025-08,50.0,50.0,50.0,0.000000
2093,Wajir,2025-09,50.0,50.0,50.0,0.000000
2094,Wajir,2025-10,50.0,50.0,50.0,0.000000
2095,Wajir,2025-11,50.0,50.0,50.0,0.000000

In [73]:

df_p.head()

,County,Month,maize_price_per_kg,price_lag1,price_lag2,price_pct_change
0,Baringo,2015-01,47.0,NaN,NaN,NaN
1,Baringo,2015-02,47.0,47.0,NaN,0.000000
2,Baringo,2015-03,38.0,47.0,47.0,-0.191489
3,Baringo,2015-04,42.0,38.0,47.0,0.105263
4,Baringo,2015-05,45.0,42.0,38.0,0.071429

In [74]:
df_p[48:]

,County,Month,maize_price_per_kg,price_lag1,price_lag2,price_pct_change
48,Baringo,2019-01,36.0,36.0,35.0,0.000000
49,Baringo,2019-02,36.0,36.0,36.0,0.000000
50,Baringo,2019-03,36.0,36.0,36.0,0.000000
51,Baringo,2019-04,44.0,36.0,36.0,0.222222
52,Baringo,2019-05,44.0,44.0,36.0,0.000000
...,...,...,...,...,...,...
2091,Wajir,2025-07,50.0,50.0,50.0,0.000000
2092,Wajir,2025-08,50.0,50.0,50.0,0.000000
2093,Wajir,2025-09,50.0,50.0,50.0,0.000000
2094,Wajir,2025-10,50.0,50.0,50.0,0.000000
2095,Wajir,2025-11,50.0,50.0,50.0,0.000000

In [75]:
df_p['maize_price_per_kg'].isna().sum()

np.int64(0)

In [76]:
df_p.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2096 entries, 0 to 2095
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   County              2096 non-null   object
 1   Month               2096 non-null   period[M]
 2   maize_price_per_kg  2096 non-null   float64
 3   price_lag1          2080 non-null   float64
 4   price_lag2          2064 non-null   float64
 5   price_pct_change    2080 non-null   float64
dtypes: float64(4), object(1), period[M](1)
memory usage: 98.4+ KB

In [77]:
df_p[['price_lag1','price_lag2','price_pct_change']] = df_p[['price_lag1','price_lag2','price_pct_change']].fillna(0) 
df_p.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2096 entries, 0 to 2095
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   County              2096 non-null   object
 1   Month               2096 non-null   period[M]
 2   maize_price_per_kg  2096 non-null   float64
 3   price_lag1          2096 non-null   float64
 4   price_lag2          2096 non-null   float64
 5   price_pct_change    2096 non-null   float64
dtypes: float64(4), object(1), period[M](1)
memory usage: 98.4+ KB

In [78]:
# df_p.to_csv("./data/cleaned_food_prices.csv",index=False)

# Exploring rainfall dataset

In [79]:
df_rf = pd.read_csv('./data/ken-rainfall-subnat-full.csv')
df_rf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 131544 entries, 0 to 131543
Data columns (total 15 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   date       131544 non-null  object
 1   adm_level  131544 non-null  int64
 2   adm_id     131544 non-null  int64
 3   PCODE      131544 non-null  object
 4   n_pixels   131544 non-null  float64
 5   rfh        131544 non-null  float64
 6   rfh_avg    131544 non-null  float64
 7   r1h        131382 non-null  float64
 8   r1h_avg    131382 non-null  float64
 9   r3h        130896 non-null  float64
 10  r3h_avg    130896 non-null  float64
 11  rfq        131544 non-null  float64
 12  r1q        131382 non-null  float64
 13  r3q        130896 non-null  float64
 14  version    131544 non-null  object
dtypes: float64(10), int64(2), object(3)
memory usage: 15.1+ MB

In [80]:
df_rf.head()

,date,adm_level,adm_id,PCODE,n_pixels,rfh,rfh_avg,r1h,r1h_avg,r3h,r3h_avg,rfq,r1q,r3q,version
0,1981-01-01,1,51325,KE019,427.0,7.372365,15.759407,NaN,NaN,NaN,NaN,59.598840,NaN,NaN,final
1,1981-01-11,1,51325,KE019,427.0,4.325527,19.294770,NaN,NaN,NaN,NaN,38.384920,NaN,NaN,final
2,1981-01-21,1,51325,KE019,427.0,5.569087,16.265417,17.266980,51.319595,NaN,NaN,49.700817,39.536823,NaN,final
3,1981-02-01,1,51325,KE019,427.0,5.882904,12.719282,15.777517,48.279470,NaN,NaN,61.418427,38.997230,NaN,final
4,1981-02-11,1,51325,KE019,427.0,17.180328,18.768618,28.632318,47.753320,NaN,NaN,93.317700,63.753933,NaN,final

In [81]:
pcodes = df_rf['PCODE'].unique()
pcodes

array(['KE019', 'KE004', 'KE010', 'KE047', 'KE008', 'KE043', 'KE023',
       'KE037', 'KE022122', 'KE020101', 'KE021107', 'KE021104',
       'KE018090', 'KE019095', 'KE021110', 'KE003015', 'KE002010',
       'KE005022', 'KE003017', 'KE001003', 'KE006026', 'KE004018',
       'KE014064', 'KE011049', 'KE015074', 'KE016075', 'KE017088',
       'KE010046', 'KE014065', 'KE012057', 'KE012053', 'KE013060',
       'KE010045', 'KE015067', 'KE013062', 'KE047277', 'KE007031',
       'KE007032', 'KE009041', 'KE008038', 'KE041236', 'KE045266',
       'KE045264', 'KE043250', 'KE042241', 'KE044259', 'KE044258',
       'KE046273', 'KE042243', 'KE043247', 'KE041234', 'KE043252',
       'KE030157', 'KE036195', 'KE036198', 'KE034185', 'KE028150',
       'KE035188', 'KE030161', 'KE031165', 'KE028147', 'KE032168',
       'KE033182', 'KE025135', 'KE033177', 'KE026137', 'KE023124',
       'KE027143', 'KE024131', 'KE039224', 'KE040230', 'KE037206',
       'KE037201', 'KE037199', 'KE039216', 'KE040226', 'KE038213',
       'KE010048', 'KE043251', 'KE029156', 'KE029151'], dtype=object)

In [82]:
# Mapping of PCODEs to parent County
pcode_to_county = {
    'KE001': 'Mombasa',
    'KE002': 'Kwale',
    'KE003': 'Kilifi',
    'KE004': 'Tana River',
    'KE005': 'Lamu',
    'KE006': 'Taita Taveta',
    'KE007': 'Garissa',
    'KE008': 'Wajir',
    'KE009': 'Mandera',
    'KE010': 'Marsabit',
    'KE011': 'Isiolo',
    'KE012': 'Meru',
    'KE013': 'Tharaka-Nithi',
    'KE014': 'Embu',
    'KE015': 'Kitui',
    'KE016': 'Machakos',
    'KE017': 'Makueni',
    'KE018': 'Nyandarua',
    'KE019': 'Nyeri',
    'KE020': 'Kirinyaga',
    'KE021': "Murang'a",
    'KE022': 'Kiambu',
    'KE023': 'Turkana',
    'KE024': 'West Pokot',
    'KE025': 'Samburu',
    'KE026': 'Trans Nzoia',
    'KE027': 'Uasin Gishu',
    'KE028': 'Elgeyo-Marakwet',
    'KE029': 'Nandi',
    'KE030': 'Baringo',
    'KE031': 'Laikipia',
    'KE032': 'Nakuru',
    'KE033': 'Narok',
    'KE034': 'Kajiado',
    'KE035': 'Kericho',
    'KE036': 'Bomet',
    'KE037': 'Kakamega',
    'KE038': 'Vihiga',
    'KE039': 'Bungoma',
    'KE040': 'Busia',
    'KE041': 'Siaya',
    'KE042': 'Kisumu',
    'KE043': 'Homa Bay',
    'KE044': 'Migori',
    'KE045': 'Kisii',
    'KE046': 'Nyamira',
    'KE047': 'Nairobi'
}
    

# Map PCODEs to County using first 5 characters
df_rf['County'] = df_rf['PCODE'].str[:5].map(pcode_to_county)

In [83]:
df_rf['County'].isna().sum()

np.int64(0)

In [84]:
df_rf[['r3q','r1q','r1h','r3h']].isna().sum()

r3q    648
r1q    162
r1h    162
r3h    648
dtype: int64

In [85]:
df_rf.columns

Index(['date', 'adm_level', 'adm_id', 'PCODE', 'n_pixels', 'rfh', 'rfh_avg',
       'r1h', 'r1h_avg', 'r3h', 'r3h_avg', 'rfq', 'r1q', 'r3q', 'version',
       'County'],
      dtype='object')

In [86]:
df_rf.rename(columns={'date':'Month'},inplace=True)

df_rf['Month'] = pd.to_datetime(df_rf['Month'])
df_rf['Month'] = df_rf['Month'].dt.to_period('M')

# keeping only desired columns
df_rf = df_rf[['County','Month','r3q','r1q','r1h','r3h']].copy()
#keeping only data starting from 2015
df_rf = df_rf[df_rf['Month'] >= pd.Period('2015-01',freq='M')].copy()
df_rf.reset_index(drop=True, inplace=True)
df_rf

      County    Month        r3q         r1q         r1h        r3h
0      Nyeri  2015-01   86.57619   77.379820   50.241220  299.25995
1      Nyeri  2015-01   80.26043   66.153660   39.461357  262.82437
2      Nyeri  2015-01   80.66898   40.696980   17.920374  234.88760
3      Nyeri  2015-02   75.89226   39.467552   16.028103  185.48714
4      Nyeri  2015-02   74.08890   86.012990   40.374710  152.06558
...      ...      ...        ...         ...         ...        ...
32395  Nandi  2025-12  124.19288  184.370240  159.190480  447.76190
32396  Nandi  2026-01  107.89541  216.239200  160.666670  358.42860
32397  Nandi  2026-01  109.68791  104.247110   82.857150  344.80954
32398  Nandi  2026-01   88.48301   48.673717   31.976189  253.64287
32399  Nandi  2026-02   97.43493   85.683950   62.261900  249.95240

[32400 rows x 6 columns]

In [87]:
df_rf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32400 entries, 0 to 32399
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   County  32400 non-null  object
 1   Month   32400 non-null  period[M]
 2   r3q     32400 non-null  float64
 3   r1q     32400 non-null  float64
 4   r1h     32400 non-null  float64
 5   r3h     32400 non-null  float64
dtypes: float64(4), object(1), period[M](1)
memory usage: 1.5+ MB

In [88]:
# aggregate monthly r3q and r1q
df_rf = df_rf.groupby(['County','Month'],as_index = False).agg(
    {'r3q': 'mean',
     'r1h': 'mean',
     'r3h': 'mean',
     'r1q': 'mean'}
)
df_rf

          County    Month         r3q         r1h         r3h         r1q
0        Baringo  2015-01   83.577607   16.909585  148.835562   50.298597
1        Baringo  2015-02   73.369926   14.057185   90.915615   54.021410
2        Baringo  2015-03   41.034449   18.335422   49.302195   37.700909
3        Baringo  2015-04   84.964367  144.816952  177.209555  121.662451
4        Baringo  2015-05   91.392305  129.329858  292.482222   90.333584
...          ...      ...         ...         ...         ...         ...
6293  West Pokot  2025-10  177.417617  200.611110  437.405903  255.023020
6294  West Pokot  2025-11  182.305203  114.213145  414.087310  137.889608
6295  West Pokot  2025-12  172.804807   22.681406  337.505667   62.984572
6296  West Pokot  2026-01  106.345640   18.571429  155.465983   85.386549
6297  West Pokot  2026-02   64.575560   14.326530   59.255100   80.049580

[6298 rows x 6 columns]

In [ ]:
# df_rf.to_csv('./data/cleaned_rain.csv',index = False)

# Exploring and Cleaning Conflict Data

In [90]:
import pandas as pd
df_c = pd.read_excel('./data/Africa_aggregated_data_up_to-2026-02-07.xlsx')
df_c.head()

,WEEK,REGION,COUNTRY,ADMIN1,EVENT_TYPE,SUB_EVENT_TYPE,EVENTS,FATALITIES,POPULATION_EXPOSURE,DISORDER_TYPE,ID,CENTROID_LATITUDE,CENTROID_LONGITUDE
0,2004-10-23,Northern Africa,Algeria,Adrar,Battles,Armed clash,1,2,NaN,Political violence,47.0,26.4839,-1.388
1,2005-04-23,Northern Africa,Algeria,Adrar,Battles,Armed clash,1,0,NaN,Political violence,47.0,26.4839,-1.388
2,2005-06-25,Northern Africa,Algeria,Adrar,Battles,Armed clash,1,14,NaN,Political violence,47.0,26.4839,-1.388
3,2008-12-13,Northern Africa,Algeria,Adrar,Battles,Armed clash,1,3,NaN,Political violence,47.0,26.4839,-1.388
4,2009-04-18,Northern Africa,Algeria,Adrar,Battles,Armed clash,1,2,NaN,Political violence,47.0,26.4839,-1.388

In [91]:
# filtering to kenyan data only and relevant rows
df_c = df_c.loc[df_c['COUNTRY'].str.lower() == 'kenya',['WEEK','ADMIN1','EVENTS','FATALITIES']].copy()
df_c.head()

            WEEK   ADMIN1  EVENTS  FATALITIES
86776 1998-01-24  Baringo       1           0
86777 1999-01-16  Baringo       1           0
86778 1999-09-25  Baringo       1           0
86779 2004-08-07  Baringo       1           1
86780 2005-04-02  Baringo       1           0

In [92]:
df_c.info()

<class 'pandas.core.frame.DataFrame'>
Index: 15579 entries, 86776 to 102354
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   WEEK        15579 non-null  datetime64[ns]
 1   ADMIN1      15579 non-null  object
 2   EVENTS      15579 non-null  int64
 3   FATALITIES  15579 non-null  int64
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 608.6+ KB

In [93]:
df_c = (
    df_c
       .assign(Month = df_c['WEEK'].dt.to_period('M'))
       .groupby(['ADMIN1','Month'])
       .agg({'FATALITIES': 'sum','EVENTS': 'sum'})
       .reset_index())

df_c.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5874 entries, 0 to 5873
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ADMIN1      5874 non-null   object
 1   Month       5874 non-null   period[M]
 2   FATALITIES  5874 non-null   int64
 3   EVENTS      5874 non-null   int64
dtypes: int64(2), object(1), period[M](1)
memory usage: 183.7+ KB

In [94]:
df_c.head()

    ADMIN1    Month  FATALITIES  EVENTS
0  Baringo  1998-01           0       1
1  Baringo  1998-06           0       1
2  Baringo  1999-01           0       1
3  Baringo  1999-09           0       2
4  Baringo  2000-12           1       1

In [95]:
# start with data from 2015 onwards
df_c = df_c.loc[df_c['Month'] >= pd.Period('2015-01',freq = 'M')].reset_index(drop=True).copy()
print(df_c.info())
print('\nConflict Sample:')
display(df_c.head(10))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3903 entries, 0 to 3902
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ADMIN1      3903 non-null   object
 1   Month       3903 non-null   period[M]
 2   FATALITIES  3903 non-null   int64
 3   EVENTS      3903 non-null   int64
dtypes: int64(2), object(1), period[M](1)
memory usage: 122.1+ KB
None

Conflict Sample:

    ADMIN1    Month  FATALITIES  EVENTS
0  Baringo  2015-01           1       1
1  Baringo  2015-02           1       1
2  Baringo  2015-03           0       1
3  Baringo  2015-04           1       1
4  Baringo  2015-05          54       3
5  Baringo  2016-01           4       2
6  Baringo  2016-10           1       1
7  Baringo  2016-11           0       1
8  Baringo  2016-12           0       2
9  Baringo  2017-02          16       7

In [96]:
df_c.rename(columns={'ADMIN1':'County','FATALITIES':'Fatalities','EVENTS':'Events'},inplace=True)
df_c.head()

    County    Month  Fatalities  Events
0  Baringo  2015-01           1       1
1  Baringo  2015-02           1       1
2  Baringo  2015-03           0       1
3  Baringo  2015-04           1       1
4  Baringo  2015-05          54       3

In [97]:
df_c['County'].nunique()

47

In [98]:
df_c.tail(30)

          County    Month  Fatalities  Events
3873  West Pokot  2023-08           1       6
3874  West Pokot  2023-09           3       7
3875  West Pokot  2023-10           2       3
3876  West Pokot  2023-11           9       6
3877  West Pokot  2023-12           3       3
3878  West Pokot  2024-01           1       6
3879  West Pokot  2024-02           0       5
3880  West Pokot  2024-03           0       1
3881  West Pokot  2024-04           1       2
3882  West Pokot  2024-05           1       2
3883  West Pokot  2024-06           0       5
3884  West Pokot  2024-07           2       1
3885  West Pokot  2024-08           2       7
3886  West Pokot  2024-09           0       3
3887  West Pokot  2024-10           3       3
3888  West Pokot  2024-11           0       2
3889  West Pokot  2024-12           0       2
3890  West Pokot  2025-01           0       1
3891  West Pokot  2025-02           1       3
3892  West Pokot  2025-03           0       4
3893  West Pokot  2025-04           3       2
3894  West Pokot  2025-05           0       5
3895  West Pokot  2025-06           0       2
3896  West Pokot  2025-07           0       3
3897  West Pokot  2025-08           2       3
3898  West Pokot  2025-09           0       5
3899  West Pokot  2025-10           5       3
3900  West Pokot  2025-11           1       5
3901  West Pokot  2025-12           1       1
3902  West Pokot  2026-01           0       2

In [99]:
# create a df with all county - month combinations covered.
months = pd.date_range(start='2015-01-01',end='2025-12',freq='MS').to_period('M')
counties = df_c['County'].unique()

# creating skeleton df
skl = pd.MultiIndex.from_product([months,counties],names=['Month','County']).to_frame(index=False)

# merging and filling
df_c = pd.merge(skl,df_c,on =['County','Month'] ,how='left')
# filling null values with 0
df_c[['Fatalities','Events']] = df_c[['Fatalities','Events']].fillna(0)

In [100]:
df_c.head(30)

      Month           County  Fatalities  Events
0   2015-01          Baringo         1.0     1.0
1   2015-01            Bomet         0.0     2.0
2   2015-01          Bungoma         1.0     1.0
3   2015-01            Busia         0.0     1.0
4   2015-01  Elgeyo Marakwet         0.0     0.0
5   2015-01             Embu         0.0     0.0
6   2015-01          Garissa         0.0     0.0
7   2015-01         Homa Bay         2.0     2.0
8   2015-01           Isiolo         0.0     0.0
9   2015-01          Kajiado         1.0     1.0
10  2015-01         Kakamega         0.0     0.0
11  2015-01          Kericho         0.0     0.0
12  2015-01           Kiambu         0.0     0.0
13  2015-01           Kilifi         0.0     1.0
14  2015-01        Kirinyaga         0.0     0.0
15  2015-01            Kisii         0.0     0.0
16  2015-01           Kisumu         0.0     1.0
17  2015-01            Kitui         0.0     1.0
18  2015-01            Kwale         0.0     1.0
19  2015-01         Laikipia         0.0     1.0
20  2015-01             Lamu         9.0     1.0
21  2015-01         Machakos         0.0     3.0
22  2015-01          Makueni         0.0     0.0
23  2015-01          Mandera         0.0     1.0
24  2015-01         Marsabit         0.0     4.0
25  2015-01             Meru         0.0     1.0
26  2015-01           Migori         0.0     0.0
27  2015-01          Mombasa         2.0     3.0
28  2015-01          Muranga         0.0     1.0
29  2015-01          Nairobi         8.0    11.0

In [101]:
df_c.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6204 entries, 0 to 6203
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Month       6204 non-null   period[M]
 1   County      6204 non-null   object
 2   Fatalities  6204 non-null   float64
 3   Events      6204 non-null   float64
dtypes: float64(2), object(1), period[M](1)
memory usage: 194.0+ KB

In [102]:
# df_c.to_csv('./data/cleaned_conflicts.csv',index=False)

Explore vegetation data

In [103]:
ndvi = pd.read_csv('./data/ken-ndvi-subnat-full.csv')
print(ndvi.info())
ndvi.head(10)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 68850 entries, 0 to 68849
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       68850 non-null  object
 1   adm_level  68850 non-null  int64
 2   adm_id     68850 non-null  int64
 3   PCODE      68850 non-null  object
 4   n_pixels   68850 non-null  float64
 5   vim        68850 non-null  float64
 6   vim_avg    68850 non-null  float64
 7   viq        68850 non-null  float64
dtypes: float64(4), int64(2), object(2)
memory usage: 4.2+ MB
None

,date,adm_level,adm_id,PCODE,n_pixels,vim,vim_avg,viq
0,2002-07-01,1,51325,KE019,427.0,0.668536,0.684022,97.890240
1,2002-07-11,1,51325,KE019,427.0,0.658954,0.668657,98.649890
2,2002-07-21,1,51325,KE019,427.0,0.647139,0.657200,98.577350
3,2002-08-01,1,51325,KE019,427.0,0.636151,0.647714,98.342830
4,2002-08-11,1,51325,KE019,427.0,0.626647,0.640161,98.041870
5,2002-08-21,1,51325,KE019,427.0,0.616663,0.633099,97.593895
6,2002-09-01,1,51325,KE019,427.0,0.607007,0.626824,97.072180
7,2002-09-11,1,51325,KE019,427.0,0.598897,0.622517,96.487854
8,2002-09-21,1,51325,KE019,427.0,0.595050,0.621554,96.053410
9,2002-10-01,1,51325,KE019,427.0,0.599500,0.626105,96.064990

In [104]:
# Mapping PCODEs to County using first 5 characters
ndvi['County'] = ndvi['PCODE'].str[:5].map(pcode_to_county)

# renaming date to Month and aligning it with our other datasets
ndvi.rename(columns={'date':'Month'},inplace=True)
ndvi['Month'] = pd.to_datetime(ndvi['Month'])
ndvi['Month'] = ndvi['Month'].dt.to_period('M')

ndvi = ndvi.loc[ndvi['Month'] >= pd.Period('2015-01',freq='M'),['County','Month','vim','viq']].reset_index(drop=True).copy()

ndvi.head(20)

   County    Month       vim         viq
0   Nyeri  2015-01  0.675912   97.759790
1   Nyeri  2015-01  0.647016   96.500970
2   Nyeri  2015-01  0.618583   95.282360
3   Nyeri  2015-02  0.592075   94.295570
4   Nyeri  2015-02  0.572094   93.724290
5   Nyeri  2015-02  0.560143   93.519950
6   Nyeri  2015-03  0.554891   93.439255
7   Nyeri  2015-03  0.558923   93.625410
8   Nyeri  2015-03  0.577016   94.450640
9   Nyeri  2015-04  0.607171   95.778030
10  Nyeri  2015-04  0.641674   97.147300
11  Nyeri  2015-04  0.677292   98.608110
12  Nyeri  2015-05  0.708768  100.034180
13  Nyeri  2015-05  0.731229  101.267450
14  Nyeri  2015-05  0.742838  102.264250
15  Nyeri  2015-06  0.743663  102.986800
16  Nyeri  2015-06  0.737286  103.492294
17  Nyeri  2015-06  0.726306  103.752460
18  Nyeri  2015-07  0.710937  103.666855
19  Nyeri  2015-07  0.692194  103.275090

In [105]:
# I need to aggregate month data
ndvi = ndvi.groupby(['County','Month'],as_index=False).agg(
    {'vim':'mean',
     'viq': 'mean'}
)

In [106]:
ndvi.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6298 entries, 0 to 6297
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   County  6298 non-null   object
 1   Month   6298 non-null   period[M]
 2   vim     6298 non-null   float64
 3   viq     6298 non-null   float64
dtypes: float64(2), object(1), period[M](1)
memory usage: 196.9+ KB

In [107]:
ndvi.duplicated().sum()

np.int64(0)

In [108]:
#